---
kind: method
id: M:Autodesk.Revit.DB.Analysis.VectorAtPoint.#ctor(Autodesk.Revit.DB.Analysis.VectorAtPoint)
source: html/9fae67e6-79af-edfc-f295-6733b0481892.htm
---
# Autodesk.Revit.DB.Analysis.VectorAtPoint.#ctor Method

Creates a copy of the given VectorAtPoint instance.

## Syntax (C#)
```csharp
public VectorAtPoint(
	VectorAtPoint otherObject
)
```

## Parameters
- **otherObject** (`Autodesk.Revit.DB.Analysis.VectorAtPoint`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null